# Data Visualization

## Amazon Sales Analysis (2019)

We have obtained Amazon Sales Data for each month in 2019. It's located in `data/`

Up to now, we've only dealt with aggregated data (in one file/location), but in this case, we have multiple csv files that we need to draw from.

Use a loop to conveniently store all of the data in one place.

In [1]:
# required imports
import os
import pandas as pd
import matplotlib.pyplot as plt
from itertools import combinations
from collections import Counter

# the path
path = './data/Sales_Data'

### Exercise 1: Merge data from each month into one CSV (step-by-step)

In [2]:
# 1.1 read the data files (names)

sales_january = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_January_2019.csv"
sales_february = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_February_2019.csv"
sales_march = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_March_2019.csv"
sales_april = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_April_2019.csv"
sales_may = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_May_2019.csv"
sales_june = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_June_2019.csv"
sales_july = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_July_2019.csv"
sales_august = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_August_2019.csv"
sales_september = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_September_2019.csv"
sales_october = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_October_2019.csv"
sales_november = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_November_2019.csv"
sales_december = "C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/Sales_December_2019.csv"

sales_files = [sales_january, sales_february, sales_march, sales_april, sales_may, sales_june, 
               sales_july, sales_august, sales_september, sales_october, sales_november, sales_december]

In [3]:
# 1.2 concat data from all files into one file `data/all_data.csv`

df = pd.concat(map(pd.read_csv, sales_files), ignore_index=True)
df.to_csv("C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/all_data.csv")

In [4]:
file_df = pd.read_csv(sales_january)
file_df.columns

Index(['Order ID', 'Product', 'Quantity Ordered', 'Price Each', 'Order Date',
       'Purchase Address'],
      dtype='object')

In [5]:
# 1.3 read the updated dataframe

all_files = pd.read_csv("C:/Users/Simona/Desktop/Data Analysis/concordia-bootcamp/ds-data-visualization-P2-main/ds-data-visualization-P2-main/data/Sales_Data/Sales_Data/all_data.csv")
df = all_files.copy()
df.head()

,Unnamed: 0,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

### Exercise 2: Clean up the data!

In [6]:
# 2.1 Drop rows of NAN

print(len(df))
df.dropna(inplace=True)
df=df.drop('Unnamed: 0', axis=1)
print(len(df))

186850
186305

In [7]:
df = df[df['Order ID']!='Order ID']
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [8]:
# 2.2 Get rid of text in order date column

df['Order Date'] = df['Order Date'].str.replace("/","")
df['Order Date'] = df['Order Date'].str.replace(":","")
df['Order Date'] = df['Order Date'].str.replace(" ","")

In [9]:
# 2.3 Make columns correct type

df['Order ID']=pd.to_numeric(df['Order ID'])
df['Quantity Ordered']=pd.to_numeric(df['Quantity Ordered'])
df['Price Each']=pd.to_numeric(df['Price Each'])
df['Order Date']=pd.to_numeric(df['Order Date'])
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 185950 entries, 0 to 186849
Data columns (total 6 columns):
 #   Column            Non-Null Count   Dtype
---  ------            --------------   -----
 0   Order ID          185950 non-null  int64
 1   Product           185950 non-null  object
 2   Quantity Ordered  185950 non-null  int64
 3   Price Each        185950 non-null  float64
 4   Order Date        185950 non-null  int64
 5   Purchase Address  185950 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.9+ MB

In [10]:
df.sample(10)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
91504,228532,Google Phone,1,600.00,731191714,"401 Lakeview St, Portland, OR 97035"
4220,145232,Wired Headphones,1,11.99,108191848,"621 Hickory St, Boston, MA 02215"
50591,189528,AA Batteries (4-pack),1,3.84,412191058,"896 Dogwood St, Portland, OR 97035"
125660,261230,34in Ultrawide Monitor,1,379.99,1006191113,"839 South St, San Francisco, CA 94016"
77204,214854,Wired Headphones,1,11.99,601191535,"86 Ridge St, Los Angeles, CA 90001"
38251,177763,AAA Batteries (4-pack),1,2.99,408191206,"570 Center St, San Francisco, CA 94016"
69275,207329,Wired Headphones,1,11.99,517191709,"329 Cherry St, Los Angeles, CA 90001"
84659,221996,iPhone,1,700.00,620192000,"217 Meadow St, Dallas, TX 75001"
176933,310183,USB-C Charging Cable,1,11.95,1229191049,"986 Main St, Los Angeles, CA 90001"
20169,160495,Lightning Charging Cable,1,14.95,210191330,"593 Dogwood St, San Francisco, CA 94016"

### Exercise 3: Augment data with additional columns

In [11]:
# 3.1 Add month column

df['Month'] = df.apply(lambda row : str(row['Order Date'])[:-8],axis=1)
df['Month']=pd.to_numeric(df['Month'])
df

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month
0,141234,iPhone,1,700.00,122192125,"944 Walnut St, Boston, MA 02215",1
1,141235,Lightning Charging Cable,1,14.95,128191415,"185 Maple St, Portland, OR 97035",1
2,141236,Wired Headphones,2,11.99,117191333,"538 Adams St, San Francisco, CA 94016",1
3,141237,27in FHD Monitor,1,149.99,105192033,"738 10th St, Los Angeles, CA 90001",1
4,141238,Wired Headphones,1,11.99,125191159,"387 10th St, Austin, TX 73301",1
...,...,...,...,...,...,...,...
186845,319666,Lightning Charging Cable,1,14.95,1211192058,"14 Madison St, San Francisco, CA 94016",12
186846,319667,AA Batteries (4-pack),2,3.84,1201191201,"549 Willow St, Los Angeles, CA 90001",12
186847,319668,Vareebadd Phone,1,400.00,1209190643,"273 Wilson St, Seattle, WA 98101",12
186848,319669,Wired Headphones,1,11.99,1203191039,"778 River St, Dallas, TX 75001",12
186849,319670,Bose SoundSport Headphones,1,99.99,1221192145,"747 Chestnut St, Los Angeles, CA 90001",12

In [12]:
df.Month.describe()

count    185950.000000
mean          7.059140
std           3.502996
min           1.000000
25%           4.000000
50%           7.000000
75%          10.000000
max          12.000000
Name: Month, dtype: float64

In [13]:
# 3.2 Add city column

df['City'] = df.apply(lambda row : row['Purchase Address'].split(",")[-2],axis=1)
df.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,City
0,141234,iPhone,1,700.00,122192125,"944 Walnut St, Boston, MA 02215",1,Boston
1,141235,Lightning Charging Cable,1,14.95,128191415,"185 Maple St, Portland, OR 97035",1,Portland
2,141236,Wired Headphones,2,11.99,117191333,"538 Adams St, San Francisco, CA 94016",1,San Francisco
3,141237,27in FHD Monitor,1,149.99,105192033,"738 10th St, Los Angeles, CA 90001",1,Los Angeles
4,141238,Wired Headphones,1,11.99,125191159,"387 10th St, Austin, TX 73301",1,Austin

### Exercise 4: Data Exploration!

#### Question 4.1: What was the best month for sales? How much was earned that month?

In [14]:
# 4.1

grp_month = df.groupby('Month')
print(grp_month['Price Each'].sum()[grp_month['Price Each'].sum()==(grp_month['Price Each'].sum().max())])
grp_month['Price Each'].sum()

# The best month for sales was in December.

Month
12    4588415.41
Name: Price Each, dtype: float64

Month
1     1811768.38
2     2188884.72
3     2791207.83
4     3367671.02
5     3135125.13
6     2562025.61
7     2632539.56
8     2230345.42
9     2084992.09
10    3715554.83
11    3180600.68
12    4588415.41
Name: Price Each, dtype: float64

In [15]:
# 4.1 continued

print(f"The best month for sales was December, which earned {grp_month['Price Each'].sum()[12]}$")
grp_month['Price Each'].sum()[12]

# The revenue for December of 2019 was 4,588,415.41$

The best month for sales was December, which earned 4588415.41$

4588415.41

#### Question 4.2: What city sold the most product?

In [16]:
# 4.2

grp_city = df.groupby('City')
print(grp_city['Quantity Ordered'].sum()[grp_city['Quantity Ordered'].sum()==grp_city['Quantity Ordered'].sum().max()])

City
 San Francisco    50239
Name: Quantity Ordered, dtype: int64

In [17]:
# 4.2 continued

print(f"\nSan Fransisco sold {grp_city['Quantity Ordered'].sum().max()} products.")

grp_city['Quantity Ordered'].sum()

San Fransisco sold 50239 products.

City
 Atlanta          16602
 Austin           11153
 Boston           22528
 Dallas           16730
 Los Angeles      33289
 New York City    27932
 Portland         14053
 San Francisco    50239
 Seattle          16553
Name: Quantity Ordered, dtype: int64

#### Question 4.3: What time should we display advertisements to maximize likelihood of customer's buying product?

In [18]:
# 4.3.1 Add hour column

df['Hour'] = df.apply(lambda row : str(row['Order Date'])[-4:-2],axis=1)
print(df['Hour'].describe())
df.head(1)

count     185950
unique        24
top           19
freq       12905
Name: Hour, dtype: object

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address,Month,City,Hour
0,141234,iPhone,1,700.0,122192125,"944 Walnut St, Boston, MA 02215",1,Boston,21

In [19]:
# 4.3.2 Results

grp_hour = df.groupby('Hour')
print(f"\nYou should display advertisements at 7PM (hour 19) \nto maximize likelihood of customers buying product.","\n")
print(grp_hour['Quantity Ordered'].sum()[grp_hour['Quantity Ordered'].sum()==grp_hour['Quantity Ordered'].sum().max()],"\n")
grp_hour['Quantity Ordered'].sum()

You should display advertisements at 7PM (hour 19)
to maximize likelihood of customers buying product.

Hour
19    14470
Name: Quantity Ordered, dtype: int64

Hour
00     4428
01     2619
02     1398
03      928
04      937
05     1493
06     2810
07     4556
08     7002
09     9816
10    12308
11    14005
12    14202
13    13685
14    12362
15    11391
16    11662
17    12229
18    13802
19    14470
20    13768
21    12244
22     9899
23     7065
Name: Quantity Ordered, dtype: int64

#### Question 4.4: What products are most often sold together?

In [20]:
# https://stackoverflow.com/questions/43348194/pandas-select-rows-if-id-appear-several-time
# Referenced: https://stackoverflow.com/questions/27298178/concatenate-strings-from-several-rows-using-pandas-groupby
# Referenced: https://stackoverflow.com/questions/52195887/counting-unique-pairs-of-numbers-into-a-python-dictionary

counts = df['Order ID'].value_counts()
df_counts = df[df['Order ID'].isin(counts.index[counts>1])]
df_multiple_products = df_counts.groupby('Order ID', as_index = False).agg({'Product': ' '.join})
df_multiple_products['Product'].value_counts()[df_multiple_products['Product'].value_counts()==df_multiple_products['Product'].value_counts().max()]

iPhone Lightning Charging Cable    882
Name: Product, dtype: int64

In [21]:
# Answer: The products most often sold together are the iPhone along with 
# a lightning charging cable with 882 orders.
print(f"The products most often sold together are the iPhone along with \na lightning charging cable with 882 orders.")

The products most often sold together are the iPhone along with
a lightning charging cable with 882 orders.

## Exercise 5: Most Popular Product?

What product sold the most? Why do you think it sold the most?

In [22]:
# exercise 5

print(df['Product'].value_counts()[df['Product'].value_counts()==df['Product'].value_counts().max()])
df['Product'].value_counts()

USB-C Charging Cable    21903
Name: Product, dtype: int64

USB-C Charging Cable          21903
Lightning Charging Cable      21658
AAA Batteries (4-pack)        20641
AA Batteries (4-pack)         20577
Wired Headphones              18882
Apple Airpods Headphones      15549
Bose SoundSport Headphones    13325
27in FHD Monitor               7507
iPhone                         6842
27in 4K Gaming Monitor         6230
34in Ultrawide Monitor         6181
Google Phone                   5525
Flatscreen TV                  4800
Macbook Pro Laptop             4724
ThinkPad Laptop                4128
20in Monitor                   4101
Vareebadd Phone                2065
LG Washing Machine              666
LG Dryer                        646
Name: Product, dtype: int64

In [23]:
# exercise 5 continued
# Referenced: https://stackoverflow.com/questions/14762181/adding-a-y-axis-label-to-secondary-y-axis-in-matplotlib

print(f"I think the USB-C charging cable sold the most because it replaces multiple other \nelectrical cables such as USB-A, USB-B, HDMI, DisplayPort, and 3.5mm audiojacks, \nwhich in turn aggregates the consumers of all those cables toward one newer cable.")

I think the USB-C charging cable sold the most because it replaces multiple other
electrical cables such as USB-A, USB-B, HDMI, DisplayPort, and 3.5mm audiojacks,
which in turn aggregates the consumers of all those cables toward one newer cable.

## Note

This activity was taken from https://github.com/KeithGalli/Pandas-Data-Science-Tasks. We modified to be exercises rather than a code-along tutorial. 

Once you have completed all, or as much as you can, of the activity, feel free to watch [Keith Galli's accompanying video](https://www.youtube.com/watch?v=eMOA1pPVUc4).